linux/en.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="cn" xml:lang="cn">
<head>
<title>Linux很有趣，可我的英文太差了，怎么办？</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Linux很有趣，可我的英文太差了，怎么办？"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-05-21 13:17:57 CST"/>
<meta name="author" content="WANG Xiaolin"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="http://cs2.swfu.edu.cn/org-info-js/org-manual.css" type="text/css">
</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Linux很有趣，可我的英文太差了，怎么办？</h1>

<p>首先，从日常应用的角度来讲，Linux和Windows并没有什么不同，他们都有很好的中文支持。但作为计科系的学生，我们不能只是站在应用的层面上，用它来上上网，写写报告，看看电影，听听音乐……还应该把它当做一个强大的学习和开发工具来利用。
</p>
<p>
讲到学习，对于很多同学来说，英文就成了一个大问题，同时也是一个不能回避的问题。从某种程度上讲，学英文比学Linux更有用。因为你毕业以后很可能根本用不到Linux，甚至可能根本用不到电脑，但我相信你肯定用得到英文。英文是你与世界交流的必要手段。
</p>
<p>
我们把文盲叫做睁眼瞎，那么在全球化的今天，英文盲实在是个睁眼半瞎。IT领域的几乎一切技术（除了算盘）都是西方发明的，英文也是一切现行IT技术标准（ISO, RFC, ITU, IEEE&hellip;）的通用语言。在我们每天使用的键盘上，也看不到任何一个中文字符。在这种现实条件下，如果想扩展视野，想了解掌握新技术，想在IT行业有所发展，没有良好的英文水平是根本不可能的。 
</p>
<p>
GNU/Linux也是以西方为主流的技术，Linux方面的英文材料远多于中文材料，而且质量远高于中文材料。所以说，要学好Linux，必须要有比较好的英文阅读能力。
</p>
<p>
诸位花钱进学校就是要来学习的。而学习本身就是顽强不懈、克服困难的过程。既然知道自己的英文差，那么当然应该努力提高它，克服它。其实，大家可以通过学习Linux来提高自己的英文能力。提高了英文能力，反过来又大大有助于Linux学习。
</p>
<p>
学英文比学Linux更容易，因为它不需要你聪明，只需要你有足够的耐心。
</p>

<div id="table-of-contents">
<h2>目录</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">如何提高英文？</a></li>
<li><a href="#sec-2">Linux学习步骤</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">如何提高英文？</h2>
<div class="outline-text-2" id="text-1">

<p>  学英文，当然可以如<a href="http://zh.wikipedia.org/wiki/辜鸿铭">辜鴻銘</a>那般背诵《莎士比亚全集》。但我们学IT的，以娴熟阅读技术资料为目的，那就可以比辜老前辈少花些力气。但无论如何，掌握一门新语言基本上还是个力气活，天天用，天天读，实是不二法门。
</p><ul>
<li>使用英文桌面环境
</li>
<li>遇到问题时，尽量查阅Linux英文参考资料，比如：
<ul>
<li><a href="http://cs3.swfu.edu.cn/dwww/man/">Man pages</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Linux">Wikipedia</a>
</li>
<li><a href="http://lmgtfy.com/?q=bash+tutorial">Tutorials</a>
</li>
</ul>

</li>
<li>定期，最好是每天，读一些英文文献，比如：
<ul>
<li>IT业者必读的<a href="http://www.rfc-editor.org/">RFC</a>
<ul>
<li><a href="http://www.rfc-editor.org/rfc/rfc1180.txt">RFC1180</a>, <a href="http://www.rfc-editor.org/rfc/rfc791.txt">RFC791</a>，<a href="http://www.rfc-editor.org/rfcsearch.html">&hellip;</a>
</li>
</ul>

</li>
<li><a href="http://fullcirclemagazine.org/downloads/">Ubuntu社区杂志</a>
</li>
</ul>

</li>
<li>看英文文章的时候，遇到生词，马上查出它的意思，我推荐你用<a href="http://www.google.com/dictionary">Google dictionary</a>, 它有<a href="https://addons.mozilla.org/en-US/firefox/addon/53151">Firefox</a>和<a href="https://chrome.google.com/extensions/detail/mgijmajocgfcbeboacabfgobmjgjcoja?hl=en">Chrome</a>浏览器的插件，非常方便，非常快。知道这个生词是什么意思了，就把这个词记到一张纸上。然后继续看文章，再遇到生词，再查，再记录。这样一篇文章看完，你的纸上页记了不少生词，晚上睡觉前，把纸上的词都过一遍，回忆一下它们的意思，就行了，简单吧？日积月累，水滴石穿，不出三五个月，你就不再惧怕英文了。
</li>
</ul>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Linux学习步骤</h2>
<div class="outline-text-2" id="text-2">

<ol>
<li>先熟练掌握命令行的基本操作
</li>
<li>尝试安装。我推荐Ubuntu
</li>
<li>掌握简单系统管理操作
</li>
<li>了解并适应经典开发环境
<ul>
<li>vim, emacs
</li>
<li>GCC, GDB, make
</li>
<li>git
</li>
</ul>

</li>
<li>了解一些可视化开发环境，比如eclipse, netbeans, Qt4designer, &hellip;
</li>
<li>了解<a href="http://en.wikipedia.org/wiki/LAMP_(software_bundle)">LAMP</a>开发环境
</li>
<li>了解其它常用工具
<ul>
<li>系统管理工具
</li>
<li>网络管理工具
</li>
<li>日常工作工具
</li>
</ul>

</li>
<li>娱乐
</li>
</ol>

</div>
</div>
</div>

<div id="postamble">
<p class="author">Author: WANG Xiaolin (<a href="mailto:wx672ster@gmail.com">wx672ster@gmail.com</a>)</p>
<p class="date">Date: 2013-05-21 13:17:57 CST</p>

</div>
</body>
</html>
